imgUrl = {"未知体质":"https://s1.ax1x.com/2020/05/06/YExgxK.png",
		  "湿热质":"https://s1.ax1x.com/2020/05/06/YEx4VH.png",
		  "气虚质":"https://s1.ax1x.com/2020/05/06/YExIIA.png",
		  "血瘀质":"https://s1.ax1x.com/2020/05/06/YExLM8.png",
		  "特禀质":"https://s1.ax1x.com/2020/05/06/YExvZQ.png",
		  "痰湿质":"https://s1.ax1x.com/2020/05/06/YExzIs.png",
		  "阴虚质":"https://s1.ax1x.com/2020/05/06/YEzCR0.png",
		  "阳虚质":"https://s1.ax1x.com/2020/05/06/YEzALF.png",
		  "平和质":"https://s1.ax1x.com/2020/05/06/YEzZdJ.png",
		  "气郁质":"https://s1.ax1x.com/2020/05/06/YEzeo9.png",
		}

# value2Dict ={"0":"未知体质",
# 			 "1":"湿热质",
# 			 "2":"气虚质",
# 			 "3":"血瘀质",
# 			 "4":"特禀质",
# 			 "5":"痰湿质",
# 			 "6":"阴虚质",
# 			 "7":"阳虚质",
# 			 "8":"平和质",
# 			 "9":"气郁质"}

###下面是version2版本，对应新模型，上面对应旧模型

value2Dict ={"0":"未知体质",
			 "1":"平和质",
			 "2":"气虚质",
			 "3":"气郁质",
			 "4":"湿热质",
			 "5":"痰湿质",
			 "6":"血瘀质",
			 "7":"阳虚质",
			 "8":"阴虚质"}

# type2Dict = {
# 	"不易疲劳":"1",
# 	"耐寒受热":"1",
# 	"乏力":"2",
# 	"自汗":"2",
# 	"容易生气":"3",
# 	"多愁善感":"3",
# 	"口腔溃疡":"4",
# 	"长痘痘":"4",
# 	"头胀胸闷":"5",
# 	"多痰":"5",
# 	"面色晦暗":"6",
# 	"胸胁疼痛":"6",
# 	"怕冷":"7",
# 	"乏力":"7",
# 	"口渴":"8",
# 	"自觉发热":"8",
# }

type2Dict = {
	"耐受寒热":"1","不易疲劳":"1",
	"乏力":"2","少气懒言":"2","自汗":"2","容易感冒":"2",
	"容易生气":"3","胸胁胀痛":"3","嗳气叹气":"3","多愁善感": "3",
	"消化不良":"4","大便稀":"4","易长痘痘":"4","口苦":"4","身体困重":"4","口腔溃疡":"4",
	"痰多":"5","身体水肿":"5","头胀胸闷":"5","关节疼痛":"5",
	"月经血块":"6","皮肤粗糙有瘀斑":"6","面色晦暗":"6","胸胁疼痛":"6",
	"畏寒肢冷":"7","大便稀溏":"7","乏力":"7","水肿":"7",
	"口渴":"8","自觉发热":"8","心烦":"8","失眠":"8","皮肤干燥":"8" 
}

weights2Dict = {
	"耐受寒热":0.4,"不易疲劳":0.6,
	"乏力":0.5,"少气懒言":0.2,"自汗":0.2,"容易感冒":0.1,
	"容易生气":0.3,"胸胁胀痛":0.3,"嗳气叹气":0.2,"多愁善感": 0.2,
	"消化不良":0.1,"大便稀":0.1,"易长痘痘":0.1,"口苦":0.3,"身体困重":0.2,"口腔溃疡":0.2,
	"痰多":0.3,"身体水肿":0.3,"头胀胸闷":0.2,"关节疼痛":0.2,
	"月经血块":0.3,"皮肤粗糙有瘀斑":0.3,"面色晦暗":0.2,"胸胁疼痛":0.2,
	"畏寒肢冷":0.3,"大便稀溏":0.3,"乏力":0.2,"水肿":0.2,
	"口渴":0.3,"自觉发热":0.2,"心烦":0.2,"失眠":0.2,"皮肤干燥":0.1 
}

# type2List = [
# 	{"乏力":0.5,"少气懒言":0.2,"自汗":0.2,"容易感冒":0.1},
# 	{"容易生气":0.3,"胸胁胀痛":0.3,"嗳气叹气":0.2,"多愁善感": 0.2},
# 	{"消化不良":0.1,"大便稀":0.1,"易长痘痘":0.1,"口苦":0.3,"身体困重":0.2,"口腔溃疡":0.2},
# 	{"痰多":0.3,"身体水肿":0.3,"头胀胸闷":0.2,"关节疼痛":0.2},
# 	{"月经血块":0.3,"皮肤粗糙有瘀斑":0.3,"面色晦暗":0.2,"胸胁疼痛":0.2},
# 	{"畏寒肢冷":0.3,"大便稀溏":0.3,"乏力":0.2,"水肿":0.2}
# 	{"口渴":0.3,"自觉发热":0.2,"心烦":0.2,"失眠":0.2,"皮肤干噪":0.1 }
# ]