// pages/drinks.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    drinks: { 
      '平和质': { '名字':'百莲耳汤','功效':'健脾养心安神','成分':'莲子10克、百合10克、银耳10克','状态':'热(推荐)','热量':'500卡路里'},
    '气虚质': { '名字': '花胶党参鸡汤', '功效': '健脾养胃，益气补血', '成分': '花胶干品20克、党参20克、生姜3片，鸡半只(2人份)', '状态': '热(推荐)', '热量': '500卡路里' },
    '气郁质': { '名字': '佛手猪肝汤', '功效': '调和脾胃，疏肝解郁', '成分': '佛手片10克、鲜猪肝150克、麦片10克、盐、葱适量', '状态': '热(推荐)', '热量': '500卡路里' },
    '湿热质': { '名字': '绿豆海带煲排骨汤', '功效': '清热解毒，行气利湿', '成分': '猪排骨400克、绿豆50克、鲜海带100克、生姜3~5片，陈皮1瓣', '状态': '热(推荐)', '热量': '500卡路里' },
      '痰湿质': { '名字': '冬瓜薏米猪骨汤', '功效': '健脾祛湿，利尿消肿', '成分': '猪骨500克、冬瓜700克、薏米100克、甜玉米1根、生姜1块', '状态': '热(推荐)', '热量': '500卡路里' },
      '血瘀质': { '名字': '田七排骨鸡脚汤', '功效': '活血化瘀，消肿止痛', '成分': '鸡脚数只、排骨500克、田七20克、姜1片、苹果半只', '状态': '热(推荐)', '热量': '500卡路里' },
      '阳虚质': { '名字': '参归姜枣汤', '功效': '清热解毒，利气行湿', '成分': '党参10克、当归10克、生姜6克、大枣10克', '状态': '热(推荐)', '热量': '500卡路里' },
      '阴虚质': { '名字': '杞冬参汤', '功效': '养阴益气，生津止渴', '成分': '枸杞10克、麦冬10克、西洋参10克', '状态': '热(推荐)', '热量': '500卡路里' },
    
    
    },
    body:null,
  name:null,
  use:null,
  form:null,
  tem:null,
  energy:null,
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) 
  {
    const item=wx.getStorageSync('log') || []
  if(item.length!=0){
    const body = item[0].body
    this.setData({
      body:body,
      name:this.data.drinks[body]['名字'],
      use: this.data.drinks[body]['功效'],
      form: this.data.drinks[body]['成分'],
      tem: this.data.drinks[body]['状态'],
      energy: this.data.drinks[body]['热量']
    })
  }
  else{
    wx.showModal({
      title: '提示',
      content: '检测到您还未诊断体质，请现在开始吧!',
      complete(res) {
        wx.navigateBack();
      }
    })
  }
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})